# pandas, Python Data Analysis Library

pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.
pandas is a NUMFocus sponsored project. This will help ensure the success of development of pandas as a world-class open-source project.

## Installation

    1:install ANACONDA by graphical user interface
    $conda install pandas
    
    2:$pip install pandas

# Series

A Series is a one-dimensional array-like object containing an array of data (of any
NumPy data type) and an associated array of data labels, called its index. The simplest
Series is formed from only an array of data:

In [1]:
from pandas import Series
obj= Series(['a','b','c','d',5,6,"my_name"])
obj

0          a
1          b
2          c
3          d
4          5
5          6
6    my_name
dtype: object

In [2]:
obj.name = 'my_series'
obj.index.name = 'index.name'
obj

index.name
0          a
1          b
2          c
3          d
4          5
5          6
6    my_name
Name: my_series, dtype: object

In [3]:
obj.values, obj.index, #frame.columns

(array(['a', 'b', 'c', 'd', 5, 6, 'my_name'], dtype=object),
 RangeIndex(start=0, stop=7, step=1, name='index.name'))

In [4]:
obj2 = Series([  'درس چهارم','درس سوم', 'درس دوم', 'درس اول'], index=['الف', 'ب', 'پ', 'ت'])
obj2

الف    درس چهارم
ب        درس سوم
پ        درس دوم
ت        درس اول
dtype: object

In [5]:
obj2.index

Index(['الف', 'ب', 'پ', 'ت'], dtype='object')

 # indexing

In [6]:
obj = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj['a']

-5

In [7]:
obj[['a','b']]

a   -5
b    7
dtype: int64

In [8]:
obj['d'] = "newTextD"
obj['c'] = "newTextC"
obj

d    newTextD
b           7
a          -5
c    newTextC
dtype: object

In [9]:
obj[-1]#last element
obj[:-1] # all - last element
obj[2:]

a          -5
c    newTextC
dtype: object

# like  npy array
filtering with a boolean array, scalar multiplication,or applying math functions.

In [10]:

obj = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj[obj > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
obj * obj

d    16
b    49
a    25
c     9
dtype: int64

# Dict functions of Series
Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping
of index values to data values. It can be substituted into many functions that expect a
dict.

In [14]:
obj = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
'b' in obj, 4 in obj, 4 in obj.values, 'a' in obj.index

(True, False, True, True)

# Python dict and Series
you can create a Series from Python dict by passing it.

In [16]:
python_dict = { 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Ohio': 35000}
python_dict

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [17]:
obj = Series(python_dict)
obj

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

# add/remove attribute
When only passing a dict, the index in the resulting Series will have the dict’s keys in
sorted order.values found in sdata were placed in the appropriate locations, but since
no value for 'California' was found, it appears as NaN (not a number) which is con-
sidered in pandas to mark missing or NA values. I will use the terms “missing” or “NA”
to refer to missing data.

In [18]:
python_dict = { 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Ohio': 35000}
obj = Series(python_dict,index=[0,1, 'Oregon'])
obj

0             NaN
1             NaN
Oregon    16000.0
dtype: float64

In [19]:
index = ['California', 'Ohio'] # select Ohio from dict and add new  row-> index= California value= NaN
obj = Series(python_dict, index=index)
obj

California        NaN
Ohio          35000.0
dtype: float64

# change column name

In [20]:
obj.index = ['Steve' ,'Bob']
obj

Steve        NaN
Bob      35000.0
dtype: float64

# detect missing data
The isnull and notnull functions in pandas should be used to detect missing data:

In [21]:
import pandas as pds
pds.isnull(obj)

Steve     True
Bob      False
dtype: bool

In [22]:
pds.notnull(obj)

Steve    False
Bob       True
dtype: bool

In [23]:
obj.isnull()

Steve     True
Bob      False
dtype: bool

# + - * /

In [24]:
obj1 = Series( { 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Ohio': 35000})
obj2 = Series([None, 35000], index=['California', 'Ohio'])
obj1+obj2

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah              NaN
dtype: float64

In [25]:
obj1-obj2

California    NaN
Ohio          0.0
Oregon        NaN
Texas         NaN
Utah          NaN
dtype: float64

In [26]:
obj1*obj2, obj1/obj2

(California             NaN
 Ohio          1.225000e+09
 Oregon                 NaN
 Texas                  NaN
 Utah                   NaN
 dtype: float64, California    NaN
 Ohio          1.0
 Oregon        NaN
 Texas         NaN
 Utah          NaN
 dtype: float64)

# DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric,string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index). Compared with other such DataFrame-like structures you may have used before (like R’s data.frame), row-oriented and column-oriented operations in DataFrame are treated roughly symmetrically. Under the hood, the data is stored as one or more two-dimensional blocks rather
than a list, dict, or some other collection of one-dimensional arrays.

# construct a DataFrame
There are numerous ways to construct a DataFrame, though one of the most common
is from a dict of equal-length lists or NumPy arrays

## construct by columns

In [27]:
from pandas import Series, DataFrame
# dictionary of lists with out index
#{ header: [datas],....}
data = {
        'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
        }
#Vertical Columns binding
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

## construct by  index, columns, values

In [28]:
import numpy as npy
#standard DataFrame input( Data, index, columns)
data = DataFrame(
                npy.arange(16).reshape((4, 4)), #values
                index=['Ohio', 'Colorado', 'Utah', 'New York'], #index
                columns=['one', 'two', 'three', 'four'] #columns
                )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## construct by Json format

In [29]:
#     {header : { (horizontal view) index: value, ...}}
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
                                              
pop = DataFrame(pop)
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

## construct by Series

In [30]:
frame = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}                          
frame = DataFrame(frame).T

frame

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [31]:
val = Series([1], index=["Nevada"])
frame['debt'] = val
frame

        2000  2001  2002  debt
Nevada   NaN   2.4   2.9   1.0
Ohio     1.5   1.7   3.6   NaN

In [32]:
from pandas import Series,DataFrame

python_dict1 = { 'T': 71, 'O': 1, 'U': 50, 'O': 350}
python_dict2 = { 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Ohio': 35000}

series1 = Series(python_dict1)
series2 = Series(python_dict2)

DataFrame(series1).add(DataFrame(series2))
DataFrame(series1)+DataFrame(series2)

         0
O      NaN
Ohio   NaN
Oregon NaN
T      NaN
Texas  NaN
U      NaN
Utah   NaN

In [33]:
frame=DataFrame(series1).T

frame.append(DataFrame(series2).T)

       O     Ohio   Oregon     T    Texas     U    Utah
0  350.0      NaN      NaN  71.0      NaN  50.0     NaN
0    NaN  35000.0  16000.0   NaN  71000.0   NaN  5000.0

In [34]:
frame=frame.append(DataFrame(series2).T)
frame["Texas"][0]=100
frame

       O     Ohio   Oregon     T  Texas     U    Utah
0  350.0      NaN      NaN  71.0  100.0  50.0     NaN
0    NaN  35000.0  16000.0   NaN  100.0   NaN  5000.0

# Merge, join, and concatenate

In [35]:
import pandas as pds
from pandas import DataFrame

python_dict1 = { 'T': 71, 'O': 1, 'U': 50, 'Texas': 10}
python_dict2 = { 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Ohio': 35000}

series1 = Series(python_dict1)
series2 = Series(python_dict2)

frame=DataFrame(series1).T
frame=frame.append(DataFrame(series2).T)
frame

     O     Ohio   Oregon     T  Texas     U    Utah
0  1.0      NaN      NaN  71.0     10  50.0     NaN
0  NaN  35000.0  16000.0   NaN  71000   NaN  5000.0

In [36]:

pds.concat([DataFrame(series1).T, DataFrame(series2).T]) #join='outer'

     O     Ohio   Oregon     T  Texas     U    Utah
0  1.0      NaN      NaN  71.0     10  50.0     NaN
0  NaN  35000.0  16000.0   NaN  71000   NaN  5000.0

In [37]:
pds.concat([DataFrame(series1).T, DataFrame(series2).T], join='inner')

   Texas
0     10
0  71000

In [38]:
pds.concat([DataFrame(series1).T, DataFrame(series2).T], ignore_index=True)

     O     Ohio   Oregon     T  Texas     U    Utah
0  1.0      NaN      NaN  71.0     10  50.0     NaN
1  NaN  35000.0  16000.0   NaN  71000   NaN  5000.0

# indexing and selecting
Rows can also be retrieved by position or name by a couple of methods, such as the
ix indexing field.

In [39]:
frame = pds.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])

frame.values, frame.index, frame.columns

(array([['A0', 'B0', 'C0', 'D0'],
        ['A1', 'B1', 'C1', 'D1'],
        ['A2', 'B2', 'C2', 'D2'],
        ['A3', 'B3', 'C3', 'D3']], dtype=object),
 Int64Index([0, 1, 2, 3], dtype='int64'),
 Index(['A', 'B', 'C', 'D'], dtype='object'))

In [40]:
#frame['state']
frame

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
'A' in frame.columns, 0 in frame.index, 'A' in frame.index, 'B1' in frame.values

(True, True, False, True)

In [42]:
frame['A'][0]

'A0'

The column returned when indexing a DataFrame is a view on the un-
derlying data, not a copy. Thus, any in-place modifications to the Series
will be reflected in the DataFrame. The column can be explicitly copied
using the Series’s copy method.

In [43]:
frame['D'][2]="NewYork"
frame

    A   B   C        D
0  A0  B0  C0       D0
1  A1  B1  C1       D1
2  A2  B2  C2  NewYork
3  A3  B3  C3       D3

In [44]:
import numpy as npy
frame['debt'] = npy.arange(4)
frame

    A   B   C        D  debt
0  A0  B0  C0       D0     0
1  A1  B1  C1       D1     1
2  A2  B2  C2  NewYork     2
3  A3  B3  C3       D3     3

In [45]:
frame["C"]

0    C0
1    C1
2    C2
3    C3
Name: C, dtype: object

In [46]:
frame["C"][:3]

0    C0
1    C1
2    C2
Name: C, dtype: object

In [47]:
frame["C"][:3][:2]==frame["C"][:2]

0    True
1    True
Name: C, dtype: bool

In [48]:
frame["C"][:3][1]

'C1'

For DataFrame label-indexing on the rows, I introduce the special indexing field ix. It
enables you to select a subset of the rows and columns from a DataFrame with NumPy-
like notation plus axis labels.

In [49]:
data = DataFrame(npy.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
#select by index
DataFrame(data.ix['New York']).T

          one  two  three  four
New York   12   13     14    15

In [51]:
#select by header
DataFrame(data['one']).T

     Ohio  Colorado  Utah  New York
one     0         4     8        12

In [52]:
#select by index+header
DataFrame(data.ix['New York', ['two', 'three']]).T

          two  three
New York   13     14

In [53]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [54]:
#data["New York"]#error just for header

In [55]:
 data = DataFrame(npy.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
DataFrame(data['three'] > 5)

          three
Ohio      False
Colorado   True
Utah       True
New York   True

In [57]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data[data['three'] > 5] = ">=5"
data

          one  two three four
Ohio        0    1     2    3
Colorado  >=5  >=5   >=5  >=5
Utah      >=5  >=5   >=5  >=5
New York  >=5  >=5   >=5  >=5

# add/remove column
Assigning a column that doesn’t exist will create a new column.

In [59]:
frame['new'] = 0
frame

    A   B   C        D  debt  new
0  A0  B0  C0       D0     0    0
1  A1  B1  C1       D1     1    0
2  A2  B2  C2  NewYork     2    0
3  A3  B3  C3       D3     3    0

In [60]:
frame['newNew'] = frame.index == 3
frame

    A   B   C        D  debt  new newNew
0  A0  B0  C0       D0     0    0  False
1  A1  B1  C1       D1     1    0  False
2  A2  B2  C2  NewYork     2    0  False
3  A3  B3  C3       D3     3    0   True

In [61]:
del frame['newNew']
del frame['new']
frame

    A   B   C        D  debt
0  A0  B0  C0       D0     0
1  A1  B1  C1       D1     1
2  A2  B2  C2  NewYork     2
3  A3  B3  C3       D3     3

# add/remove row

The keys in the inner dicts are unioned and sorted to form the index in the result. This
isn’t true if an explicit index is specified

In [62]:
frame = pds.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])

frame=frame.T
frame

    0   1   2   3
A  A0  A1  A2  A3
B  B0  B1  B2  B3
C  C0  C1  C2  C3
D  D0  D1  D2  D3

In [63]:
dataframe=DataFrame(frame, index=["new", "A", "B","C"]) # delete D and add new
dataframe

       0    1    2    3
new  NaN  NaN  NaN  NaN
A     A0   A1   A2   A3
B     B0   B1   B2   B3
C     C0   C1   C2   C3

# Data Loading, Storage, and File Formats

# reading

In [73]:
import pandas as pds
datafile = pds.read_csv('mpg.csv')
datafile[:5]

/root/anaconda3/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (10,13,14,15,16,17,18,24,25,26) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,class,displ,trans,cyl,trans.dscr,cty,hwy,fl,model,eng.dscr,...,hatch.p,hatch.l,T,G,drv,vpc,bidx,x5c,S,eng.dscr.2
0,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
1,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
2,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
3,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
4,1,NaN,NaN,4,M,17.6,26.1,Unleaded Gasoline,SPIDER 2000,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN

In [70]:
datafile=pds.read_table('mpg.csv', sep=',')
datafile[:5]

/root/anaconda3/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (10,13,14,15,16,17,18,24,25,26) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,class,displ,trans,cyl,trans.dscr,cty,hwy,fl,model,eng.dscr,...,hatch.p,hatch.l,T,G,drv,vpc,bidx,x5c,S,eng.dscr.2
0,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
1,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
2,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
3,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
4,1,NaN,NaN,4,M,17.6,26.1,Unleaded Gasoline,SPIDER 2000,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN

In [72]:
datafile = pds.read_csv(('mpg.csv'), header=None)
datafile[:5]

/root/anaconda3/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (1,3,5,6,10,11,13,14,15,16,17,18,19,20,22,23,25,26) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
0,class,displ,trans,cyl,trans.dscr,cty,hwy,fl,model,eng.dscr,...,hatch.p,hatch.l,T,G,drv,vpc,bidx,x5c,S,eng.dscr.2
1,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,FALSE,FALSE,NaN,NaN,NaN,NaN,FALSE,NaN
2,3,NaN,NaN,4,M,19.3,29,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,FALSE,FALSE,NaN,NaN,NaN,NaN,FALSE,NaN
3,3,NaN,NaN,4,M,19.3,29,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,FALSE,FALSE,NaN,NaN,NaN,NaN,FALSE,NaN
4,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,FALSE,FALSE,NaN,NaN,NaN,NaN,FALSE,NaN

In [77]:
datafile= pds.read_csv('mpg.csv', header=None, names=['a', 'b', 'c', 'd', 'message'])
datafile[:5]

/root/anaconda3/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (1,3,5,6,10,11,13,14,15,16,17,18,19,20,22,23,25,26) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

                                                                                                                                                                                           a  \
class displ trans cyl trans.dscr cty  hwy  fl                model   eng.dscr eng.dscr.1 year manufacturer twodoor.p twodoor.l fourdoor.p fourdoor.l hatch.p hatch.l    T     G     drv  vpc
3     NaN   NaN   4   A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN
                      M          19.3 29   Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN
                                                                                                                                                                                    NaN  NaN
                      A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN

                                                                                                                                                                                            b  \
class displ trans cyl trans.dscr cty  hwy  fl                model   eng.dscr eng.dscr.1 year manufacturer twodoor.p twodoor.l fourdoor.p fourdoor.l hatch.p hatch.l    T     G     drv  bidx
3     NaN   NaN   4   A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN   NaN
                      M          19.3 29   Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN   NaN
                                                                                                                                                                                    NaN   NaN
                      A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN   NaN

                                                                                                                                                                                           c  \
class displ trans cyl trans.dscr cty  hwy  fl                model   eng.dscr eng.dscr.1 year manufacturer twodoor.p twodoor.l fourdoor.p fourdoor.l hatch.p hatch.l    T     G     drv  x5c
3     NaN   NaN   4   A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN
                      M          19.3 29   Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN
                                                                                                                                                                                    NaN  NaN
                      A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  NaN

                                                                                                                                                                                             d  \
class displ trans cyl trans.dscr cty  hwy  fl                model   eng.dscr eng.dscr.1 year manufacturer twodoor.p twodoor.l fourdoor.p fourdoor.l hatch.p hatch.l    T     G     drv      S
3     NaN   NaN   4   A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  FALSE
                      M          19.3 29   Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  FALSE
                                                                                                                                                                                    NaN  FALSE
                      A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN  FALSE

                                                                                                                                                                                            message
class displ trans cyl trans.dscr cty  hwy  fl                model   eng.dscr eng.dscr.1 year manufacturer twodoor.p twodoor.l fourdoor.p fourdoor.l hatch.p hatch.l    T     G     drv  eng.dscr.2
3     NaN   NaN   4   A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN         NaN
                      M          19.3 29   Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN         NaN
                                                                                                                                                                                    NaN         NaN
                      A          19.3 24.8 Unleaded Gasoline ALFETTA NaN      NaN        1978 ALFA ROMEO   74        7         89         9          NaN                FALSE FALSE NaN         NaN


# reading big file

In [80]:
datafile= pds.read_csv('mpg.csv', chunksize=5)
datafile.__next__()

,class,displ,trans,cyl,trans.dscr,cty,hwy,fl,model,eng.dscr,...,hatch.p,hatch.l,T,G,drv,vpc,bidx,x5c,S,eng.dscr.2
0,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
1,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
2,3,NaN,NaN,4,M,19.3,29.0,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
3,3,NaN,NaN,4,A,19.3,24.8,Unleaded Gasoline,ALFETTA,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
4,1,NaN,NaN,4,M,17.6,26.1,Unleaded Gasoline,SPIDER 2000,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN

In [81]:
datafile.__next__()

,class,displ,trans,cyl,trans.dscr,cty,hwy,fl,model,eng.dscr,...,hatch.p,hatch.l,T,G,drv,vpc,bidx,x5c,S,eng.dscr.2
0,1,NaN,NaN,4,M,17.6000,26.1000,Unleaded Gasoline,SPIDER 2000,NaN,...,NaN,,False,False,NaN,NaN,NaN,NaN,False,NaN
1,3,NaN,NaN,6,A,18.4410,25.2715,Unleaded Gasoline,GREMLIN,NaN,...,79.0,9,False,False,NaN,NaN,NaN,NaN,False,NaN
2,3,NaN,NaN,6,A,12.7000,16.8000,Unleaded Gasoline,GREMLIN,NaN,...,79.0,9,False,False,NaN,NaN,NaN,NaN,False,NaN
3,3,NaN,NaN,6,M,13.4000,21.1000,Unleaded Gasoline,GREMLIN,NaN,...,79.0,9,False,False,NaN,NaN,NaN,NaN,False,NaN
4,3,NaN,NaN,6,M,20.0925,27.8862,Unleaded Gasoline,GREMLIN,NaN,...,79.0,9,False,False,NaN,NaN,NaN,NaN,False,NaN